package ru.jonline.mod01_01.main;

//Дан прямоугольник, ширина которого в два раза меньше длины. Найти площадь прямоугольника.

public class SeventhTask {
    public static void main(String[] args) {
        int a = 5;
        int b = a*2;
        int c = a*b;
        System.out.println("Площадь прямоугольника равна "+c);
    }
}
